// pages/content'/content.js
Component({
  /**
   * 组件的属性列表
   */
  properties: {

  },

  /**
   * 组件的初始数据
   */
  data: {
    comp_info: [{
      "id": 6,
      "src": "http://cdn1.52jingsai.com/portal/202012/05/121100j0szed27q2oe0qsz.jpg",
      "tag": "学科学术类竞赛",
      "title": "2021年（第十三届）上海市大学生计算机应用能力大赛",
      "ddl": "2020-11-15",
      "url": "http://202.120.167.82/contest",
      "background": "为贯彻落实上海市教育委员会关于深化高等教育人才培养模式创新与实践教学改革的精神，激发上海大学生学习计算机知识和技能的积极性，提高运用信息技术解决实际问题的综合能力，培养创新能力及团队合作精神，不断丰富学生课外创新性实践教育体系，在总结前十二届上海市大学生计算机应用能力大赛的基础上，继续举办第十三届上海市大学生计算机应用能力大赛。大赛同时为各高校选拔推荐参加中国大学生计算机设计大赛的作品。",
      "organization": ["上海市教育委员会", "上海市经济与信息化委员会", "上海市高等学校计算机等级考试委员会", "上海市高等学校计算机等级考试命题组"],
      "entry_requirements":[ "(1)各文档必须按要求认真撰写并提交，否则影响成绩。特别是因为疫情，需要进行在线评审，因此系统说明书、作品展示视频（配解说）要全面、充分体现作品的内容和特色。,","(2)Web类别作品、其他类别中的Web形式作品必须自建好网站，在大赛作品情况表中准确填写超链接，并保证评审期间能够流畅访问。","(3)所使用的特殊开发工具和中间件必须随作品一起提交。"],
      "time": ["学校联络人确认截止：2020年11月15日","网上报名：2020年12月1日到2021年1月10日","报名费汇款期限：2020年12月1日到2021年1月15日","作品提交：2021年3月20日到3月26日","初赛：2021年4月3日到4月11日","决赛：2021年4月17日到4月18日","颁奖：2021年5月"],
      "other": "无",
      "award": ["初赛：评审专家按学校类别分类择优推选进入决赛的作品。","决赛：现场演示并答辩，获奖作品网上公示。,\n大赛设一等奖、二等奖、三等奖和优胜奖，获奖作品将同时获上海市教育委员会颁发的获奖证书及奖牌","获奖作品择优推荐参加2021年中国大学生计算机设计大赛决赛。"],
      "contact": ["http://202.120.167.82/contest","1"]
    }]
  },

  /**
   * 组件的方法列表
   */
  methods: {

  }
})